/*******************************************************************
版权声明：HITCRT(哈工大竞技机器人协会)
文件名：HITCRT_Coff.h
最近修改日期：2011.07.07
版本：1.0
--------------------------------------------------------------------
模块描述：该模块包含一些常用的系数。
--------------------------------------------------------------------
修改记录：
作者        时间            	版本         	说明
任伟        2010.07.10          1.0        		建立此文件
********************************************************************/


#define PI			3.1415926536f
#define PI2			6.2831853072f
#define PISHORT		3.14f
#define RADIAN_10	0.00174532922f			// PI/1800，多次需要运算，故单独提取出来
#define DEG			57.29578f  
#define DEG_10		572.9578f  				//DEG*10
#define RADIAN		0.0174532922f			//PI/180 
#define RAD10		572.9578f
#define PI_2        1.570796326795f
#define	PI_3		1.0471975512f
#define PI_6		0.523598775f


#define PI_DIV_30      0.10471975f
#define PI_DIV_30_REV  9.5492967f

////////////定位相关的参数////////////////
#define ALPHA		1.04719755f						//pi/3
#define OMNI_CENTER		67.5				//随动中心与地盘中心距离


//////////////////////路径相关//////

//路段类型
#define LINE 	0
#define CIRCLE 	1
#define CIRCLE2 2//跟随切向一起转动


